# Int32
p! 1, typeof(1)
p! 100_000, typeof(100_000)

# Float64
p! 1.0, typeof(1.0)
p! 100_000.0, typeof(100_000.0)

# 同値性
p! 1 == 1, 1 == 2, 1.0 == 1, -2000.0 == -2000

# 比較
p! 2 > 1, 1 >= 1, 1 < 2, 1 <= 2
# 宇宙船演算子 (同値なら 0, 左辺のほうが大きいなら 1, 右辺のほうが大きいなら -1)
p! 1 <=> 1, 2 <=> 1, 1 <=> 3

# 四則演算
p! 1 + 1, 1 - 1, 2 * 3, 2 / 3
# べき乗
p! 2 ** 4
# 切り捨て除算
p! 2 // 3
# 剰余
p! 3 % 2
# 単項演算子
p! -1

# 優先順位
p! 4 + 5 * 2, (4 + 5) * 2

# 数値関連メソッド
p! -5.abs     # 絶対値
p! 4.3.round  # 最も近い整数
p! 5.even?    # 偶数かどうか
p! 10.gcd(16) # 最大公約数

# 数学関連メソッド・定数
p! Math.cos(Math::TAU), Math.sin(Math::PI / 2), Math.tan(Math::PI / 4)
p! Math.log(Math::E ** 4), Math.log10(1000), Math.log(121, 11)
p! Math.sqrt(36)
